Ran Plan for project: `staging` dir: `etc/terraform/environments` workspace: `staging`

<details><summary>Show Output</summary>

```diff
Initializing modules...
Downloading git::git@github.com:holaluz/kraken.git for alb...
- alb in .terraform/modules/alb/aws/ec2/alb
- alb.aws_variables in .terraform/modules/alb/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for aws_variables...
- aws_variables in .terraform/modules/aws_variables/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for basic_dashboard...
- basic_dashboard in .terraform/modules/basic_dashboard/datadog/dashboards
- basic_dashboard.alb_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb
- basic_dashboard.alb_monitor.alb_4XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/4XX
- basic_dashboard.alb_monitor.alb_4XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_5XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/5XX
- basic_dashboard.alb_monitor.alb_5XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_latency_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/latency
- basic_dashboard.alb_monitor.alb_latency_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_request_count_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/request_count
- basic_dashboard.alb_monitor.alb_request_count_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_api.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_api.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_api.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_crons.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_crons.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_crons.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors in .terraform/modules/basic_dashboard/datadog/monitors/rds
- basic_dashboard.rds_monitors.cpu_usage in .terraform/modules/basic_dashboard/datadog/monitors/rds/cpu_usage
- basic_dashboard.rds_monitors.cpu_usage.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.free_space_remaining in .terraform/modules/basic_dashboard/datadog/monitors/rds/free_space_remaining
- basic_dashboard.rds_monitors.free_space_remaining.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.replica_lag in .terraform/modules/basic_dashboard/datadog/monitors/rds/replica_lag
- basic_dashboard.rds_monitors.replica_lag.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.supervisor_monitor_crons in .terraform/modules/basic_dashboard/datadog/monitors/supervisor
- basic_dashboard.supervisor_monitor_crons.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
Downloading git::git@github.com:holaluz/kraken.git for ecs_application...
- ecs_application in .terraform/modules/ecs_application/aws/ecs/ecs_cluster_single_service
- ecs_application.ecr in .terraform/modules/ecs_application/aws/ecr
- ecs_application.ecs_cluster in .terraform/modules/ecs_application/aws/ecs/ecs_cluster
- ecs_application.ecs_service in .terraform/modules/ecs_application/aws/ecs/ecs_service
- ecs_application.ecs_service.aws_variables in .terraform/modules/ecs_application/aws/variables
- ecs_application.ecs_service.cloudwatch_log_group in .terraform/modules/ecs_application/aws/cloudwatch/log_group
- ecs_application.ecs_task in .terraform/modules/ecs_application/aws/ecs/ecs_task
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets in .terraform/modules/ecs_application/aws/iam/policy_secrets
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets.aws_variables in .terraform/modules/ecs_application/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for rds...
- rds in .terraform/modules/rds/aws/rds/postgresql
- rds.aws_variables in .terraform/modules/rds/aws/variables
- rds.db in .terraform/modules/rds/aws/rds/db
- rds.db.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.bastion in .terraform/modules/rds/aws/ec2/instance
- rds.db.bastion.ami in .terraform/modules/rds/aws/ec2/ami
- rds.db.bastion.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.bastion.cloud_init in .terraform/modules/rds/aws/ec2/cloud_init
- rds.db.bastion.iam in .terraform/modules/rds/aws/iam/instance
- rds.db.bastion.iam.instance_profile in .terraform/modules/rds/aws/iam/instance_profile
- rds.db.bastion.iam.instance_profile.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.bastion.iam.instance_s3 in .terraform/modules/rds/aws/iam/instance_s3_bucket_path
- rds.db.bastion.iam.secrets in .terraform/modules/rds/aws/iam/policy_secrets
- rds.db.bastion.iam.secrets.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.kms in .terraform/modules/rds/aws/kms
- rds.db.rds_variables in .terraform/modules/rds/aws/rds/variables
Downloading git::git@github.com:holaluz/kraken.git for sns_subscription...
- sns_subscription in .terraform/modules/sns_subscription/aws/sns/subscription
Downloading git::git@github.com:holaluz/kraken.git for sns_subscription_to_printed_invoices...
- sns_subscription_to_printed_invoices in .terraform/modules/sns_subscription_to_printed_invoices/aws/sns/subscription
Downloading git::git@github.com:holaluz/kraken.git for sns_subscription_to_relations...
- sns_subscription_to_relations in .terraform/modules/sns_subscription_to_relations/aws/sns/subscription
Downloading git::git@github.com:holaluz/kraken.git for sqs...
- sqs in .terraform/modules/sqs/aws/sqs
Downloading git::git@github.com:holaluz/kraken.git for sqs_printed_invoices...
- sqs_printed_invoices in .terraform/modules/sqs_printed_invoices/aws/sqs
Downloading git::git@github.com:holaluz/kraken.git for sqs_relations...
- sqs_relations in .terraform/modules/sqs_relations/aws/sqs

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/random versions matching "~> 3.1"...
- Finding hashicorp/local versions matching "~> 2.1"...
- Finding datadog/datadog versions matching "~> 3.1"...
- Finding hashicorp/aws versions matching "~> 3.0, ~> 3.64"...
- Finding hashicorp/template versions matching "~> 2.1"...
- Installing hashicorp/random v3.2.0...
- Installed hashicorp/random v3.2.0 (signed by HashiCorp)
- Installing hashicorp/local v2.2.3...
- Installed hashicorp/local v2.2.3 (signed by HashiCorp)
- Installing datadog/datadog v3.12.0...
- Installed datadog/datadog v3.12.0 (signed by a HashiCorp partner, key ID FB70BE941301C3EA)
- Installing hashicorp/aws v3.75.2...
- Installed hashicorp/aws v3.75.2 (signed by HashiCorp)
- Installing hashicorp/template v2.2.0...
- Installed hashicorp/template v2.2.0 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Switched to workspace "staging".

Downloading git::git@github.com:holaluz/kraken.git for alb...
- alb in .terraform/modules/alb/aws/ec2/alb
- alb.aws_variables in .terraform/modules/alb/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for aws_variables...
- aws_variables in .terraform/modules/aws_variables/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for basic_dashboard...
- basic_dashboard in .terraform/modules/basic_dashboard/datadog/dashboards
- basic_dashboard.alb_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb
- basic_dashboard.alb_monitor.alb_4XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/4XX
- basic_dashboard.alb_monitor.alb_4XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_5XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/5XX
- basic_dashboard.alb_monitor.alb_5XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_latency_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/latency
- basic_dashboard.alb_monitor.alb_latency_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_request_count_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/request_count
- basic_dashboard.alb_monitor.alb_request_count_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_api.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_api.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_api.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_crons.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_crons.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_crons.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors in .terraform/modules/basic_dashboard/datadog/monitors/rds
- basic_dashboard.rds_monitors.cpu_usage in .terraform/modules/basic_dashboard/datadog/monitors/rds/cpu_usage
- basic_dashboard.rds_monitors.cpu_usage.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.free_space_remaining in .terraform/modules/basic_dashboard/datadog/monitors/rds/free_space_remaining
- basic_dashboard.rds_monitors.free_space_remaining.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.replica_lag in .terraform/modules/basic_dashboard/datadog/monitors/rds/replica_lag
- basic_dashboard.rds_monitors.replica_lag.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.supervisor_monitor_crons in .terraform/modules/basic_dashboard/datadog/monitors/supervisor
- basic_dashboard.supervisor_monitor_crons.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
Downloading git::git@github.com:holaluz/kraken.git for ecs_application...
- ecs_application in .terraform/modules/ecs_application/aws/ecs/ecs_cluster_single_service
- ecs_application.ecr in .terraform/modules/ecs_application/aws/ecr
- ecs_application.ecs_cluster in .terraform/modules/ecs_application/aws/ecs/ecs_cluster
- ecs_application.ecs_service in .terraform/modules/ecs_application/aws/ecs/ecs_service
- ecs_application.ecs_service.aws_variables in .terraform/modules/ecs_application/aws/variables
- ecs_application.ecs_service.cloudwatch_log_group in .terraform/modules/ecs_application/aws/cloudwatch/log_group
- ecs_application.ecs_task in .terraform/modules/ecs_application/aws/ecs/ecs_task
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets in .terraform/modules/ecs_application/aws/iam/policy_secrets
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets.aws_variables in .terraform/modules/ecs_application/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for rds...
- rds in .terraform/modules/rds/aws/rds/postgresql
- rds.aws_variables in .terraform/modules/rds/aws/variables
- rds.db in .terraform/modules/rds/aws/rds/db
- rds.db.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.bastion in .terraform/modules/rds/aws/ec2/instance
- rds.db.bastion.ami in .terraform/modules/rds/aws/ec2/ami
- rds.db.bastion.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.bastion.cloud_init in .terraform/modules/rds/aws/ec2/cloud_init
- rds.db.bastion.iam in .terraform/modules/rds/aws/iam/instance
- rds.db.bastion.iam.instance_profile in .terraform/modules/rds/aws/iam/instance_profile
- rds.db.bastion.iam.instance_profile.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.bastion.iam.instance_s3 in .terraform/modules/rds/aws/iam/instance_s3_bucket_path
- rds.db.bastion.iam.secrets in .terraform/modules/rds/aws/iam/policy_secrets
- rds.db.bastion.iam.secrets.aws_variables in .terraform/modules/rds/aws/variables
- rds.db.kms in .terraform/modules/rds/aws/kms
- rds.db.rds_variables in .terraform/modules/rds/aws/rds/variables
Downloading git::git@github.com:holaluz/kraken.git for sns_subscription...
- sns_subscription in .terraform/modules/sns_subscription/aws/sns/subscription
Downloading git::git@github.com:holaluz/kraken.git for sns_subscription_to_printed_invoices...
- sns_subscription_to_printed_invoices in .terraform/modules/sns_subscription_to_printed_invoices/aws/sns/subscription
Downloading git::git@github.com:holaluz/kraken.git for sns_subscription_to_relations...
- sns_subscription_to_relations in .terraform/modules/sns_subscription_to_relations/aws/sns/subscription
Downloading git::git@github.com:holaluz/kraken.git for sqs...
- sqs in .terraform/modules/sqs/aws/sqs
Downloading git::git@github.com:holaluz/kraken.git for sqs_printed_invoices...
- sqs_printed_invoices in .terraform/modules/sqs_printed_invoices/aws/sqs
Downloading git::git@github.com:holaluz/kraken.git for sqs_relations...
- sqs_relations in .terraform/modules/sqs_relations/aws/sqs


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.rds.module.db.module.bastion.aws_route53_record.instance has been changed
! resource "aws_route53_record" "instance" {
        id      = "Z3VBSH4Z3N3V93_dragonite.bastion.staging.clidom.es._A"
        name    = "dragonite.bastion.staging.clidom.es"
        # (5 unchanged attributes hidden)
    }
  # module.rds.module.db.aws_db_instance.rds has been changed
! resource "aws_db_instance" "rds" {
        id                                    = "dragonite-staging"
!       latest_restorable_time                = "2022-05-25T15:53:04Z" -> "2022-05-27T10:39:32Z"
        name                                  = ""
+       security_group_names                  = []
        tags                                  = {
            "Application" = "dragonite"
            "Backup"      = "daily"
            "Deployment"  = "terraform"
            "Environment" = "staging"
            "Monitored"   = "datadog"
            "Name"        = "dragonite-staging-rds"
            "Owner"       = "onefees"
            "Resource"    = "rds"
        }
        # (56 unchanged attributes hidden)
    }
  # module.rds.module.db.aws_route53_record.main has been changed
! resource "aws_route53_record" "main" {
        id      = "Z3VBSH4Z3N3V93_dragonite-staging.db.clidom.es._CNAME"
        name    = "dragonite-staging.db.clidom.es"
        # (5 unchanged attributes hidden)
    }
  # module.ecs_application.module.ecs_task.aws_iam_role.task_role[0] has been changed
! resource "aws_iam_role" "task_role" {
        id                    = "ecs-execution-role-dragonite-staging"
        name                  = "ecs-execution-role-dragonite-staging"
        tags                  = {
            "Application" = "dragonite"
            "Deployment"  = "terraform"
            "Environment" = "staging"
            "Monitored"   = "datadog"
            "Name"        = "ecs-task-dragonite-staging"
            "Owner"       = "onefees"
        }
        # (9 unchanged attributes hidden)

-       inline_policy {
-           name   = "sqs-dragonite-staging-1009424496" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = [
-                               "sqs:SendMessage",
-                               "sqs:ReceiveMessage",
-                               "sqs:GetQueueUrl",
-                               "sqs:GetQueueAttributes",
-                               "sqs:DeleteMessage",
                            ]
-                           Effect   = "Allow"
-                           Resource = "arn:aws:sqs:eu-west-1:165908609791:invoicing-dragonite-incoming-relation-staging.fifo"
-                           Sid      = ""
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
-       inline_policy {
-           name   = "sqs-dragonite-staging-997650548" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = [
-                               "sqs:SendMessage",
-                               "sqs:ReceiveMessage",
-                               "sqs:GetQueueUrl",
-                               "sqs:GetQueueAttributes",
-                               "sqs:DeleteMessage",
                            ]
-                           Effect   = "Allow"
-                           Resource = "arn:aws:sqs:eu-west-1:165908609791:invoicing-dragonite-incoming-invoices-staging"
-                           Sid      = ""
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
        # (1 unchanged block hidden)
    }
  # module.rds.module.db.module.bastion.module.iam.module.instance_profile.aws_iam_role.instance has been changed
! resource "aws_iam_role" "instance" {
        id                    = "bastion-dragonite-staging"
!       managed_policy_arns   = [
+           "arn:aws:iam::165908609791:policy/hlz-sessionmanager-s3-ec2-policy",
+           "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
        ]
        name                  = "bastion-dragonite-staging"
+       tags                  = {}
        # (9 unchanged attributes hidden)

-       inline_policy {}
+       inline_policy {
+           name   = "bastion-dragonite-staging-secrets"
+           policy = jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = [
+                               "secretsmanager:ListSecretVersionIds",
+                               "secretsmanager:GetSecretValue",
+                               "secretsmanager:GetResourcePolicy",
+                               "secretsmanager:DescribeSecret",
                            ]
+                           Effect   = "Allow"
+                           Resource = "arn:aws:secretsmanager:eu-west-1:165908609791:secret:bastion-dragonite-staging-application-*"
+                           Sid      = ""
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            )
        }
+       inline_policy {
+           name   = "ec2-describe-tags"
+           policy = jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = "ec2:DescribeTags"
+                           Effect   = "Allow"
+                           Resource = "*"
+                           Sid      = ""
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            )
        }
+       inline_policy {
+           name   = "holaluz-apps-bastion-dragonite-staging-s3"
+           policy = jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = "s3:ListBucket"
+                           Effect   = "Allow"
+                           Resource = "arn:aws:s3:::holaluz-apps"
+                           Sid      = ""
                        },
+                       {
+                           Action   = [
+                               "s3:PutObjectAcl",
+                               "s3:PutObject",
+                               "s3:GetObjectVersion",
+                               "s3:GetObject",
                            ]
+                           Effect   = "Allow"
+                           Resource = "arn:aws:s3:::holaluz-apps/bastion-dragonite/staging/*"
+                           Sid      = ""
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            )
        }
    }
  # module.rds.module.db.module.bastion.module.iam.module.instance_profile.aws_iam_instance_profile.instance has been changed
! resource "aws_iam_instance_profile" "instance" {
        id          = "bastion-dragonite-staging"
        name        = "bastion-dragonite-staging"
+       tags        = {}
        # (6 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.sns_subscription.data.aws_iam_policy_document.sns_events will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sns_events"  {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "SQS:SendMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]

+           condition {
+               test     = "ArnEquals"
+               values   = [
+                   "arn:aws:sns:eu-west-1:165908609791:oak-generated-invoices-staging",
                ]
+               variable = "aws:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
    }

  # module.sns_subscription.aws_sns_topic_subscription.sns_topic_subscription will be created
+ resource "aws_sns_topic_subscription" "sns_topic_subscription" {
+       arn                             = (known after apply)
+       confirmation_timeout_in_minutes = 1
+       confirmation_was_authenticated  = (known after apply)
+       endpoint                        = (known after apply)
+       endpoint_auto_confirms          = true
+       id                              = (known after apply)
+       owner_id                        = (known after apply)
+       pending_confirmation            = (known after apply)
+       protocol                        = "sqs"
+       raw_message_delivery            = true
+       topic_arn                       = "arn:aws:sns:eu-west-1:165908609791:oak-generated-invoices-staging"
    }

  # module.sns_subscription.aws_sqs_queue_policy.sns_events will be created
+ resource "aws_sqs_queue_policy" "sns_events" {
+       id        = (known after apply)
+       policy    = (known after apply)
+       queue_url = (known after apply)
    }

  # module.sns_subscription_to_printed_invoices.data.aws_iam_policy_document.sns_events will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sns_events"  {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "SQS:SendMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]

+           condition {
+               test     = "ArnEquals"
+               values   = [
+                   "arn:aws:sns:eu-west-1:165908609791:invoicing-killbill-outgoing-documents-staging",
                ]
+               variable = "aws:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
    }

  # module.sns_subscription_to_printed_invoices.aws_sns_topic_subscription.sns_topic_subscription will be created
+ resource "aws_sns_topic_subscription" "sns_topic_subscription" {
+       arn                             = (known after apply)
+       confirmation_timeout_in_minutes = 1
+       confirmation_was_authenticated  = (known after apply)
+       endpoint                        = (known after apply)
+       endpoint_auto_confirms          = true
+       id                              = (known after apply)
+       owner_id                        = (known after apply)
+       pending_confirmation            = (known after apply)
+       protocol                        = "sqs"
+       raw_message_delivery            = true
+       topic_arn                       = "arn:aws:sns:eu-west-1:165908609791:invoicing-killbill-outgoing-documents-staging"
    }

  # module.sns_subscription_to_printed_invoices.aws_sqs_queue_policy.sns_events will be created
+ resource "aws_sqs_queue_policy" "sns_events" {
+       id        = (known after apply)
+       policy    = (known after apply)
+       queue_url = (known after apply)
    }

  # module.sns_subscription_to_relations.data.aws_iam_policy_document.sns_events will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sns_events"  {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "SQS:SendMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]

+           condition {
+               test     = "ArnEquals"
+               values   = [
+                   "arn:aws:sns:eu-west-1:165908609791:engage-ate-relation-staging.fifo",
                ]
+               variable = "aws:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
    }

  # module.sns_subscription_to_relations.aws_sns_topic_subscription.sns_topic_subscription will be created
+ resource "aws_sns_topic_subscription" "sns_topic_subscription" {
+       arn                             = (known after apply)
+       confirmation_timeout_in_minutes = 1
+       confirmation_was_authenticated  = (known after apply)
+       endpoint                        = (known after apply)
+       endpoint_auto_confirms          = true
+       id                              = (known after apply)
+       owner_id                        = (known after apply)
+       pending_confirmation            = (known after apply)
+       protocol                        = "sqs"
+       raw_message_delivery            = true
+       topic_arn                       = "arn:aws:sns:eu-west-1:165908609791:engage-ate-relation-staging.fifo"
    }

  # module.sns_subscription_to_relations.aws_sqs_queue_policy.sns_events will be created
+ resource "aws_sqs_queue_policy" "sns_events" {
+       id        = (known after apply)
+       policy    = (known after apply)
+       queue_url = (known after apply)
    }

  # module.sqs.data.aws_iam_policy_document.sqs_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sqs_assume_role_policy"  {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "sqs:DeleteMessage",
+               "sqs:GetQueueAttributes",
+               "sqs:GetQueueUrl",
+               "sqs:ReceiveMessage",
+               "sqs:SendMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
        }
    }

  # module.sqs.aws_iam_role_policy.sqs_fullaccess will be created
+ resource "aws_iam_role_policy" "sqs_fullaccess" {
+       id     = (known after apply)
+       name   = (known after apply)
+       policy = (known after apply)
+       role   = "ecs-execution-role-dragonite-staging"
    }

  # module.sqs.aws_sqs_queue.dead_letter_queue[0] will be created
+ resource "aws_sqs_queue" "dead_letter_queue" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 0
+       fifo_queue                        = false
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 262144
+       message_retention_seconds         = 1209600
+       name                              = "DL-invoicing-dragonite-incoming-invoices-staging"
+       name_prefix                       = (known after apply)
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 0
+       tags                              = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-staging"
+           "Owner"       = "onefees"
+           "Resource"    = "sqs-queue"
        }
+       tags_all                          = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-staging"
+           "Owner"       = "onefees"
+           "Resource"    = "sqs-queue"
        }
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 30
    }

  # module.sqs.aws_sqs_queue.sqs_queues["invoicing-dragonite-incoming-invoices-staging"] will be created
+ resource "aws_sqs_queue" "sqs_queues" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 0
+       fifo_queue                        = false
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 262144
+       message_retention_seconds         = 1209600
+       name                              = "invoicing-dragonite-incoming-invoices-staging"
+       name_prefix                       = (known after apply)
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 0
+       redrive_policy                    = (known after apply)
+       tags                              = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-staging"
+           "Owner"       = "onefees"
+           "Resource"    = "sqs-queue"
        }
+       tags_all                          = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-staging"
+           "Owner"       = "onefees"
+           "Resource"    = "sqs-queue"
        }
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 30
    }

  # module.sqs_printed_invoices.data.aws_iam_policy_document.sqs_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sqs_assume_role_policy"  {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "sqs:DeleteMessage",
+               "sqs:GetQueueAttributes",
+               "sqs:GetQueueUrl",
+               "sqs:ReceiveMessage",
+               "sqs:SendMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
        }
    }

  # module.sqs_printed_invoices.aws_iam_role_policy.sqs_fullaccess will be created
+ resource "aws_iam_role_policy" "sqs_fullaccess" {
+       id     = (known after apply)
+       name   = (known after apply)
+       policy = (known after apply)
+       role   = "ecs-execution-role-dragonite-staging"
    }

  # module.sqs_printed_invoices.aws_sqs_queue.dead_letter_queue[0] will be created
+ resource "aws_sqs_queue" "dead_letter_queue" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 0
+       fifo_queue                        = false
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 262144
+       message_retention_seconds         = 1209600
+       name                              = "DL-invoicing-dragonite-incoming-documents-staging"
+       name_prefix                       = (known after apply)
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 0
+       tags                              = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-staging"
+           "Owner"       = "onefees"
+           "Resource"    = "sqs-queue"
        }
+       tags_all                          = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-staging"
+           "Owner"       = "onefees"
+           "Resource"    = "sqs-queue"
        }
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 30
    }

  # module.sqs_printed_invoices.aws_sqs_queue.sqs_queues["invoicing-dragonite-incoming-documents-staging"] will be created
+ resource "aws_sqs_queue" "sqs_queues" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 0
+       fifo_queue                        = false
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 262144
+       message_retention_seconds         = 1209600
+       name                              = "invoicing-dragonite-incoming-documents-staging"
+       name_prefix                       = (known after apply)
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 0
+       redrive_policy                    = (known after apply)
+       tags                              = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-staging"
+           "Owner"       = "onefees"
+           "Resource"    = "sqs-queue"
        }
+       tags_all                          = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-staging"
+           "Owner"       = "onefees"
+           "Resource"    = "sqs-queue"
        }
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 30
    }

  # module.sqs_relations.data.aws_iam_policy_document.sqs_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sqs_assume_role_policy"  {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "sqs:DeleteMessage",
+               "sqs:GetQueueAttributes",
+               "sqs:GetQueueUrl",
+               "sqs:ReceiveMessage",
+               "sqs:SendMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
        }
    }

  # module.sqs_relations.aws_iam_role_policy.sqs_fullaccess will be created
+ resource "aws_iam_role_policy" "sqs_fullaccess" {
+       id     = (known after apply)
+       name   = (known after apply)
+       policy = (known after apply)
+       role   = "ecs-execution-role-dragonite-staging"
    }

  # module.sqs_relations.aws_sqs_queue.dead_letter_queue[0] will be created
+ resource "aws_sqs_queue" "dead_letter_queue" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 0
+       fifo_queue                        = true
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 262144
+       message_retention_seconds         = 1209600
+       name                              = "DL-invoicing-dragonite-incoming-relation-staging.fifo"
+       name_prefix                       = (known after apply)
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 0
+       tags                              = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-staging"
+           "Owner"       = "onefees"
+           "Resource"    = "sqs-queue"
        }
+       tags_all                          = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-staging"
+           "Owner"       = "onefees"
+           "Resource"    = "sqs-queue"
        }
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 30
    }

  # module.sqs_relations.aws_sqs_queue.sqs_queues["invoicing-dragonite-incoming-relation-staging.fifo"] will be created
+ resource "aws_sqs_queue" "sqs_queues" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 0
+       fifo_queue                        = true
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 262144
+       message_retention_seconds         = 1209600
+       name                              = "invoicing-dragonite-incoming-relation-staging.fifo"
+       name_prefix                       = (known after apply)
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 0
+       redrive_policy                    = (known after apply)
+       tags                              = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-staging"
+           "Owner"       = "onefees"
+           "Resource"    = "sqs-queue"
        }
+       tags_all                          = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = "staging"
+           "Monitored"   = "datadog"
+           "Name"        = "dragonite-staging"
+           "Owner"       = "onefees"
+           "Resource"    = "sqs-queue"
        }
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 30
    }

  # module.rds.module.db.module.bastion.aws_instance.instance will be updated in-place
! resource "aws_instance" "instance" {
        id                                   = "i-0eaf81023a9ba3fd9"
        tags                                 = {
            "Application" = "bastion-dragonite"
            "Deployment"  = "terraform"
            "Environment" = "staging"
            "Monitored"   = "datadog"
            "Name"        = "bastion-dragonite-staging"
            "OS"          = "Ubuntu"
            "Platform"    = "linux"
            "Resource"    = "ec2"
            "Version"     = "18.04"
        }
+       volume_tags                          = {}
        # (28 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

Plan: 15 to add, 1 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.basic_dashboard.module.rds_monitors.module.replica_lag.module.this.datadog_monitor.this,
│   on .terraform/modules/basic_dashboard/datadog/monitors/monitor/monitor.tf line 3, in resource "datadog_monitor" "this":
│    3:   locked              = false
│ 
│ Use `restricted_roles`.
│ 
│ (and 23 more similar warnings elsewhere)
╵

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0100   168  100    16  100   152    341   3245 --:--:-- --:--:-- --:--:--  3652
{"status": "ok"}
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p staging`
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p staging`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 15 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
